3A/CS349/Layout.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-25 Sun 02:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Layout</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Layout</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbcc0d82">1. Box Model</a>
<ul>
<li><a href="#orgd64c90c">1.1. Basis Size and Layout Size</a></li>
</ul>
</li>
<li><a href="#org1078a88">2. Layout Strategies</a>
<ul>
<li><a href="#orgdeb3f09">2.1. Strategy Design Pattern for Layouts</a></li>
<li><a href="#org053e752">2.2. Responsive Layout</a></li>
<li><a href="#orge8855c8">2.3. Widget Basis Sizes</a></li>
<li><a href="#org2ddcf00">2.4. Variable Intrinsic Layout</a></li>
<li><a href="#org1516707">2.5. Layout Invalidation</a></li>
<li><a href="#org1c97cb3">2.6. Best Pratices</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbcc0d82" class="outline-2">
<h2 id="orgbcc0d82"><span class="section-number-2">1.</span> Box Model</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Layout</b>: the visual arrangement of widgets in a UI
</p>

<p>
UI elements typically use a hierarchy of dimensions for size.
</p>

<p>
The box model has 4 dimensions:
</p>
<ul class="org-ul">
<li><b>margin</b>: outside space away from other elements</li>
<li><b>border</b>: thickness of stroke outlining element</li>
<li><b>padding</b>: insider space between border and content</li>
<li><b>content</b>: actual content of the element</li>
</ul>

<p>
Standard CSS Box Model
</p>
<ul class="org-ul">
<li>width and height defined by the content size</li>
<li>actual rendered size is content size plus padding and border</li>
</ul>

<p>
Alternative CSS Box Model
</p>
<ul class="org-ul">
<li>width and height defined the rendered element size</li>
<li>content size is actual rendered size minus padding and border</li>
</ul>
</div>
<div id="outline-container-orgd64c90c" class="outline-3">
<h3 id="orgd64c90c"><span class="section-number-3">1.1.</span> Basis Size and Layout Size</h3>
<div class="outline-text-3" id="text-1-1">
<p>
An element may be rendered larger/smaller than its width and height.
Width and height do not even have to be defined.
</p>

<p>
<b>Basis Size</b>: element&rsquo;s normal size inside margins (considering padding and content)
</p>

<p>
<b>Layout Size</b>: element&rsquo;s size after layout including margin, how much space the
element occupies in the layout
</p>
</div>
</div>
</div>
<div id="outline-container-org1078a88" class="outline-2">
<h2 id="org1078a88"><span class="section-number-2">2.</span> Layout Strategies</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgdeb3f09" class="outline-3">
<h3 id="orgdeb3f09"><span class="section-number-3">2.1.</span> Strategy Design Pattern for Layouts</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Factor out layout algorithm into a separate function, allow an element to choose the
algorithm.
</p>

<p>
Factory pattern for making layout functions enables optional properties for
layout algorithm.
</p>

<p>
Layout algorithms include fixed, center, wrap (row), fill, and more.
</p>
</div>
</div>
<div id="outline-container-org053e752" class="outline-3">
<h3 id="org053e752"><span class="section-number-3">2.2.</span> Responsive Layout</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Dynamically reposition, resize, hide content in response to changes in screen
resolution or resizing application window.
</p>
</div>
</div>
<div id="outline-container-orge8855c8" class="outline-3">
<h3 id="orge8855c8"><span class="section-number-3">2.3.</span> Widget Basis Sizes</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Widgets need to be flexible in size and position, so they store these but layouts
can change widget width/height and other properties.
Some UI toolkits support multiple basis size hints.
</p>
</div>
</div>
<div id="outline-container-org2ddcf00" class="outline-3">
<h3 id="org2ddcf00"><span class="section-number-3">2.4.</span> Variable Intrinsic Layout</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Layout attempts to use the widget preferred basis sizes but queries all widgets
first and allocates space to them as a group, so layout is determined in 2 passes:
</p>
<ol class="org-ol">
<li>get all child widgets&rsquo; preferred sizes (basis + margin)</li>
<li>decide on a layout that satisfies everyone&rsquo;s preferences and iterate through
each child, and set its layout size and position</li>
</ol>
</div>
</div>
<div id="outline-container-org1516707" class="outline-3">
<h3 id="org1516707"><span class="section-number-3">2.5.</span> Layout Invalidation</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Every time widget size or layout-related property changes, at least some of the UI
must be laid out again. Could even be multiple changes each frame of the run loop.
</p>

<p>
The best practice is to run layout at most once per run-loop frame.
</p>

<p>
If widget size or layout property changes, calling the invalidate layout method
ensures layout is done just before drawing next run-loop frame.
</p>
</div>
</div>
<div id="outline-container-org1c97cb3" class="outline-3">
<h3 id="org1c97cb3"><span class="section-number-3">2.6.</span> Best Pratices</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Break UI into regions, layout each one, and nest if necessary.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-25 Sun 02:13</p>
</div>
</body>
</html>
